cfd/straight_12/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
convertToMeters 1;
vertices (
(0.023 -0.128 0)
(0.111 -0.04 0)
(0.004 -0.035 0)
(0.042 -0.01 0)
(0.004 0.002 0)
(0.04 0.002 0)
(0.004 0.04 0)
(0.04 0.04 0)
(0.004 0.1 0)
(0.04 0.1 0)
(0.004 0.156 0)
(0.04 0.156 0)
(0.004 0.192 0)
(0.04 0.192 0)
(0.004 0.198 0)
(0.04 0.198 0)
(0.0211429 0.218 0)
(0.038 0.218 0)
(0.0245714 0.222 0)
(0.038 0.222 0)
(0.0262857 0.224 0)
(0.04 0.224 0)
(0.028 0.226 0)
(0.04 0.226 0)
(0.028 0.232 0)
(0.04 0.232 0)
(0.023 -0.128 0.001)
(0.111 -0.04 0.001)
(0.004 -0.035 0.001)
(0.042 -0.01 0.001)
(0.004 0.002 0.001)
(0.04 0.002 0.001)
(0.004 0.04 0.001)
(0.04 0.04 0.001)
(0.004 0.1 0.001)
(0.04 0.1 0.001)
(0.004 0.156 0.001)
(0.04 0.156 0.001)
(0.004 0.192 0.001)
(0.04 0.192 0.001)
(0.004 0.198 0.001)
(0.04 0.198 0.001)
(0.0211429 0.218 0.001)
(0.038 0.218 0.001)
(0.0245714 0.222 0.001)
(0.038 0.222 0.001)
(0.0262857 0.224 0.001)
(0.04 0.224 0.001)
(0.028 0.226 0.001)
(0.04 0.226 0.001)
(0.028 0.232 0.001)
(0.04 0.232 0.001));
blocks (
hex (0 1 3 2 26 27 29 28) (18 43 1) simpleGrading (1 1 1)
hex (2 3 5 4 28 29 31 30) (18 12 1) simpleGrading (1 1 1)
hex (4 5 7 6 30 31 33 32) (18 19 1) simpleGrading (1 1 1)
hex (6 7 9 8 32 33 35 34) (18 30 1) simpleGrading (1 1 1)
hex (8 9 11 10 34 35 37 36) (18 28 1) simpleGrading (1 1 1)
hex (10 11 13 12 36 37 39 38) (18 18 1) simpleGrading (1 1 1)
hex (12 13 15 14 38 39 41 40) (18 3 1) simpleGrading (1 1 1)
hex (14 15 17 16 40 41 43 42) (18 12 1) simpleGrading (1 1 1)
hex (16 17 19 18 42 43 45 44) (18 2 1) simpleGrading (1 1 1)
hex (18 19 21 20 44 45 47 46) (18 2 1) simpleGrading (1 1 1)
hex (20 21 23 22 46 47 49 48) (18 2 1) simpleGrading (1 1 1)
hex (22 23 25 24 48 49 51 50) (18 3 1) simpleGrading (1 1 1));
edges ();
boundary (
walls { type wall; faces ( (0 2 28 26)
(1 27 29 3)
(2 4 30 28)
(3 29 31 5)
(4 6 32 30)
(5 31 33 7)
(6 8 34 32)
(7 33 35 9)
(8 10 36 34)
(9 35 37 11)
(10 12 38 36)
(12 14 40 38)
(13 39 41 15)
(14 16 42 40)
(15 41 43 17)
(16 18 44 42)
(17 43 45 19)
(18 20 46 44)
(19 45 47 21)
(20 22 48 46)
(21 47 49 23)
(22 24 50 48)
(23 49 51 25) ); }
laptopVent { type patch; faces ( (11 37 39 13) ); }
fanInlet { type patch; faces ( (0 26 27 1) ); }
slotOutlet { type patch; faces ( (24 25 51 50) ); }
frontBack { type empty; faces ( (0 1 3 2)
(26 28 29 27)
(2 3 5 4)
(28 30 31 29)
(4 5 7 6)
(30 32 33 31)
(6 7 9 8)
(32 34 35 33)
(8 9 11 10)
(34 36 37 35)
(10 11 13 12)
(36 38 39 37)
(12 13 15 14)
(38 40 41 39)
(14 15 17 16)
(40 42 43 41)
(16 17 19 18)
(42 44 45 43)
(18 19 21 20)
(44 46 47 45)
(20 21 23 22)
(46 48 49 47)
(22 23 25 24)
(48 50 51 49) ); });
mergePatchPairs ();
